"""

"""
import sys
from pathlib import Path

from src import printe
from src.fix.fixtitle import fixlab

from src.tests.helps import get_titles_to_tests

Dir = Path(__file__).parent

# python3 core8/pwb.py make2/tests/fix/fixtitle -list:1
# python3 core8/pwb.py make2/tests/fix/fixtitle -list:1
# python3 core8/pwb.py make2/tests/fix/fixtitle -list:3
# ---
lista = {}
# ---
lista[1] = [
    "2020 في جنوب إفريقيا",
    "عقد 2010 في جنوب إفريقيا",
    "القرن 21 في جنوب إفريقيا",
    "2020 ق م في جنوب إفريقيا",
    "عقد 2010 ق م في جنوب إفريقيا",
    "القرن 21 في الأردن",
    "عقد 1990 في السعودية",
    "1995 في الإمارات",
    "القرن 20 في مصر",
    "القرن 20 ق م في مصر",
    "عقد 1980 ق م في العراق",
    "الألفية 1 في اليمن",
    "2020 في مولدافيا",
]
# ---
lista[2] = [
]
# ---
lista[3] = [
    "تصنيف:قضاة حسب الجنسية عقد 2010",
    "تصنيف:التلفاز في السويد حسب السنة",
    "تصنيف:فنانون ذكور حسب الجنسية 2020",
    "تصنيف:قضاة حسب الجنسية القرن 20",
    "تصنيف:فنانون ذكور حسب الجنسية القرن 20",
    "تصنيف:ملكيون حسب البلد القرن 20",
    "تصنيف:فلاسفة فرنسيون في القرن 20",
]
# ---
lista[4] = [
    "تصنيف:أشخاص حسب الجنسية والمجموعة العرقية القرن 20",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 1 ق م",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 1",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 2 ق م",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 20",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 21",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 2",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 3 ق م",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 3",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 4 ق م",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 4",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 5 ق م",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 5",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 6",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 7",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 8",
    "تصنيف:أشخاص حسب الجنسية والمهنة القرن 9",
    "تصنيف:أشخاص حسب الدين والجنسية القرن 19",
    "تصنيف:أشخاص حسب الدين والجنسية القرن 20",
    "تصنيف:أشخاص حسب المجموعة العرقية القرن 12",
    "تصنيف:أشخاص حسب المجموعة العرقية القرن 14",
    "تصنيف:أشخاص حسب المجموعة العرقية القرن 15",
    "تصنيف:أشخاص حسب المجموعة العرقية القرن 16",
    "تصنيف:أشخاص حسب المجموعة العرقية القرن 20",
    "تصنيف:أشخاص حسب المجموعة العرقية القرن 21",
    "تصنيف:أشخاص حسب المهنة والجنسية القرن 10",
    "تصنيف:أشخاص حسب المهنة والجنسية القرن 11",
    "تصنيف:أشخاص حسب المهنة والجنسية القرن 12",
    "تصنيف:أشخاص حسب المهنة والجنسية القرن 18",
    "تصنيف:أشخاص حسب المهنة والجنسية القرن 7",
    "تصنيف:أشخاص حسب المهنة والجنسية القرن 8",
    "تصنيف:أشخاص حسب المهنة والجنسية القرن 9",
    "تصنيف:رجال حسب المهنة والجنسية القرن 18",
    "تصنيف:سياسيون حسب تقسيمات البلدان من المستوى الأول القرن 17",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1930",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1931",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1932",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1933",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1935",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1936",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1937",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1938",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1939",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1940",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1941",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1942",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1943",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1944",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1945",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1946",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1947",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1948",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1949",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1950",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1952",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1953",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1954",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1955",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1956",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1957",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1958",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1959",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1960",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1961",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1962",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1963",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1964",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1965",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1966",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1967",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1968",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1969",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1970",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1971",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1972",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1973",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1974",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1975",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1976",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1977",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1978",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1979",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1980",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1981",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1982",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1983",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1984",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1985",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1986",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1987",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1988",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1989",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1990",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1991",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1992",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1993",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1994",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1995",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1996",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1997",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1998",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 1999",
    "تصنيف:قوائم أفلام حسب البلد أو اللغة 2017",
    "تصنيف:قوائم أفلام حسب النوع الفني عقد 1960",
    "تصنيف:قوائم أفلام حسب النوع الفني عقد 2000",
    "تصنيف:قوائم أفلام حسب النوع الفني عقد 2010",
    "تصنيف:مسلسلات تلفزيونية إسبانية حسب النوع الفني عقد 2000",
    "تصنيف:مسلسلات تلفزيونية كندية حسب النوع الفني عقد 1950",
    "تصنيف:مسلسلات تلفزيونية كندية حسب النوع الفني عقد 1960",
    "تصنيف:مسلسلات تلفزيونية كندية حسب النوع الفني عقد 1980",
]
# ---


def get_titles_to_tests(lista):
    # ---
    to_work = []
    # ---
    for arg in sys.argv:
        arg, _, value = arg.partition(":")
        # ---
        if arg == "-list":
            to_work = lista.get(value) or lista.get(int(value)) or []
            # ---
            if not to_work:
                printe.output(f"<<red>> {value} not in lista...")
                exit()

    # ---
    if not to_work:
        if len(sys.argv) > 1:
            to_work = [" ".join(sys.argv[1:])]
            print(to_work)
        else:
            to_work = lista[1]
    # ---
    return to_work


to_work = get_titles_to_tests(lista)

same = []
# ---
data = {}
# ---
for text in to_work:
    # ---
    if not text:
        continue
    # ---
    text = text.replace("تصنيف:", "")
    text = text.replace("_", " ")
    # ---
    # printe.output(f"({text=})")
    # ---
    new = fixlab(text)
    # ---
    new = new.replace("جرائم قتل", "جرائم قتل في")
    # ---
    if new != text:
        data[text] = new
        # ---
        printe.output(f'old: "{text}"')
        printe.output(f'<<green>>new: "{new}"')
        printe.output("----------")
    else:
        same.append(text)
# ---
for text in same:
    printe.output(f'same: "{text}"')
# ---
print(f"{len(data)=} <> {len(same)=}")
# ---
text = "\n".join(f"# [[:تصنيف:{key}]]>[[:تصنيف:{val}]]" for key, val in data.items())
# ---
if same:
    text += "\n\n== same ==\n\n"
    # ---
    text += "\n".join(f"# [[:تصنيف:{key}]]" for key in same)
# ---
with open(Dir / "fixtitle.txt", "w", encoding="utf-8") as f:
    f.write(text)
# ---
